Masmiseim36/nxpSDK/boards/mimxrt700evk/edgefast_bluetooth_examples/a2dp_source/cm33_core0/pin_mux.h
/*
 * Copyright 2024 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */


/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO1_0 (coord N5), Debug_TXD
  @{ */
/* Routed pin properties */
#define BOARD_INITDEBUG_UARTPINS_Debug_TXD_PERIPHERAL LP_FLEXCOMM0  /*!<@brief Peripheral name */
#define BOARD_INITDEBUG_UARTPINS_Debug_TXD_SIGNAL P1                /*!<@brief Signal name */
#define BOARD_INITDEBUG_UARTPINS_Debug_TXD_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_Debug_TXD_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_Debug_TXD_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                                    /* @} */

/*! @name PIO0_31 (coord N4), Debug_RXD
  @{ */
/* Routed pin properties */
#define BOARD_INITDEBUG_UARTPINS_Debug_RXD_PERIPHERAL LP_FLEXCOMM0   /*!<@brief Peripheral name */
#define BOARD_INITDEBUG_UARTPINS_Debug_RXD_SIGNAL P0                 /*!<@brief Signal name */
#define BOARD_INITDEBUG_UARTPINS_Debug_RXD_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_Debug_RXD_PIN 31U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_Debug_RXD_PIN_MASK (1U << 31U)      /*!<@brief PORT pin mask */
                                                                     /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC0 0x00u            /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */
#define PDDR_PDD23_pdd1 0x01u             /*!<@brief Port Data Direction: Output */
#define PDDR_PDD7_pdd1 0x01u              /*!<@brief Port Data Direction: Output */
#define PDOR_PDO23_pdo0 0x00u             /*!<@brief Port Data Output: Logic level 0 */
#define PDOR_PDO7_pdo0 0x00u              /*!<@brief Port Data Output: Logic level 0 */

/*! @name PIO3_7 (coord H7), WL_RST
  @{ */
/* Routed pin properties */
#define BOARD_INITPINSM2_WL_RST_PERIPHERAL GPIO3                   /*!<@brief Peripheral name */
#define BOARD_INITPINSM2_WL_RST_SIGNAL IO                          /*!<@brief Signal name */
#define BOARD_INITPINSM2_WL_RST_CHANNEL 7                          /*!<@brief Signal channel */
#define BOARD_INITPINSM2_WL_RST_PORT 3U                            /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINSM2_WL_RST_PIN 7U                             /*!<@brief PORT pin number */
#define BOARD_INITPINSM2_WL_RST_PIN_MASK (1U << 7U)                /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PIO7_23 (coord N14), M2_PWREN
  @{ */
/* Routed pin properties */
#define BOARD_INITPINSM2_M2_PWREN_PERIPHERAL GPIO7                   /*!<@brief Peripheral name */
#define BOARD_INITPINSM2_M2_PWREN_SIGNAL IO                          /*!<@brief Signal name */
#define BOARD_INITPINSM2_M2_PWREN_CHANNEL 23                         /*!<@brief Signal channel */
#define BOARD_INITPINSM2_M2_PWREN_PORT 7U                            /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINSM2_M2_PWREN_PIN 23U                            /*!<@brief PORT pin number */
#define BOARD_INITPINSM2_M2_PWREN_PIN_MASK (1U << 23U)               /*!<@brief PORT pin mask */
                                                                     /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPinsM2(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_DRIVE_33OHM  (0x3 << 12) /*!< Selects transmitter current drive 33ohm */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLUP_EN 0x20u        /*!<@brief Enable pull-up function */
#define IOPCTL_PIO_PUPD_EN 0x10u          /*!<@brief Enable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO7_17 (coord L17), SDIO_CLK
  @{ */
/* Routed pin properties */
#define BOARD_INITM2_SDIOPINS_SDIO_CLK_PERIPHERAL USDHC1         /*!<@brief Peripheral name */
#define BOARD_INITM2_SDIOPINS_SDIO_CLK_SIGNAL CLK                /*!<@brief Signal name */
#define BOARD_INITM2_SDIOPINS_SDIO_CLK_PORT 7U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITM2_SDIOPINS_SDIO_CLK_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITM2_SDIOPINS_SDIO_CLK_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PIO7_18 (coord L16), SDIO_CMD
  @{ */
/* Routed pin properties */
#define BOARD_INITM2_SDIOPINS_SDIO_CMD_PERIPHERAL USDHC1         /*!<@brief Peripheral name */
#define BOARD_INITM2_SDIOPINS_SDIO_CMD_SIGNAL CMD                /*!<@brief Signal name */
#define BOARD_INITM2_SDIOPINS_SDIO_CMD_PORT 7U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITM2_SDIOPINS_SDIO_CMD_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITM2_SDIOPINS_SDIO_CMD_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PIO7_19 (coord M17), SDIO_D0
  @{ */
/* Routed pin properties */
#define BOARD_INITM2_SDIOPINS_SDIO_D0_PERIPHERAL USDHC1         /*!<@brief Peripheral name */
#define BOARD_INITM2_SDIOPINS_SDIO_D0_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITM2_SDIOPINS_SDIO_D0_CHANNEL 0                 /*!<@brief Signal channel */
#define BOARD_INITM2_SDIOPINS_SDIO_D0_PORT 7U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITM2_SDIOPINS_SDIO_D0_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_INITM2_SDIOPINS_SDIO_D0_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*! @name PIO7_20 (coord M18), SDIO_D1
  @{ */
/* Routed pin properties */
#define BOARD_INITM2_SDIOPINS_SDIO_D1_PERIPHERAL USDHC1         /*!<@brief Peripheral name */
#define BOARD_INITM2_SDIOPINS_SDIO_D1_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITM2_SDIOPINS_SDIO_D1_CHANNEL 1                 /*!<@brief Signal channel */
#define BOARD_INITM2_SDIOPINS_SDIO_D1_PORT 7U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITM2_SDIOPINS_SDIO_D1_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_INITM2_SDIOPINS_SDIO_D1_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*! @name PIO7_21 (coord K18), SDIO_D2
  @{ */
/* Routed pin properties */
#define BOARD_INITM2_SDIOPINS_SDIO_D2_PERIPHERAL USDHC1         /*!<@brief Peripheral name */
#define BOARD_INITM2_SDIOPINS_SDIO_D2_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITM2_SDIOPINS_SDIO_D2_CHANNEL 2                 /*!<@brief Signal channel */
#define BOARD_INITM2_SDIOPINS_SDIO_D2_PORT 7U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITM2_SDIOPINS_SDIO_D2_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_INITM2_SDIOPINS_SDIO_D2_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*! @name PIO7_22 (coord K17), SDIO_D3
  @{ */
/* Routed pin properties */
#define BOARD_INITM2_SDIOPINS_SDIO_D3_PERIPHERAL USDHC1         /*!<@brief Peripheral name */
#define BOARD_INITM2_SDIOPINS_SDIO_D3_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITM2_SDIOPINS_SDIO_D3_CHANNEL 3                 /*!<@brief Signal channel */
#define BOARD_INITM2_SDIOPINS_SDIO_D3_PORT 7U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITM2_SDIOPINS_SDIO_D3_PIN 22U                   /*!<@brief PORT pin number */
#define BOARD_INITM2_SDIOPINS_SDIO_D3_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitM2_SDIOPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO1_18 (coord R5), BT_UART_RXD
  @{ */
/* Routed pin properties */
#define BOARD_INITM2_UARTPINS_BT_UART_RXD_PERIPHERAL LP_FLEXCOMM3   /*!<@brief Peripheral name */
#define BOARD_INITM2_UARTPINS_BT_UART_RXD_SIGNAL P0                 /*!<@brief Signal name */
#define BOARD_INITM2_UARTPINS_BT_UART_RXD_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITM2_UARTPINS_BT_UART_RXD_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITM2_UARTPINS_BT_UART_RXD_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                                    /* @} */

/*! @name PIO1_17 (coord R4), BT_UART_TXD
  @{ */
/* Routed pin properties */
#define BOARD_INITM2_UARTPINS_BT_UART_TXD_PERIPHERAL LP_FLEXCOMM3   /*!<@brief Peripheral name */
#define BOARD_INITM2_UARTPINS_BT_UART_TXD_SIGNAL P1                 /*!<@brief Signal name */
#define BOARD_INITM2_UARTPINS_BT_UART_TXD_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITM2_UARTPINS_BT_UART_TXD_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITM2_UARTPINS_BT_UART_TXD_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                                    /* @} */

/*! @name PIO1_19 (coord P7), BT_UART_CTS
  @{ */
/* Routed pin properties */
#define BOARD_INITM2_UARTPINS_BT_UART_CTS_PERIPHERAL LP_FLEXCOMM3   /*!<@brief Peripheral name */
#define BOARD_INITM2_UARTPINS_BT_UART_CTS_SIGNAL P3                 /*!<@brief Signal name */
#define BOARD_INITM2_UARTPINS_BT_UART_CTS_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITM2_UARTPINS_BT_UART_CTS_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_INITM2_UARTPINS_BT_UART_CTS_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                                    /* @} */

/*! @name PIO1_16 (coord P5), BT_UART_RTS
  @{ */
/* Routed pin properties */
#define BOARD_INITM2_UARTPINS_BT_UART_RTS_PERIPHERAL LP_FLEXCOMM3   /*!<@brief Peripheral name */
#define BOARD_INITM2_UARTPINS_BT_UART_RTS_SIGNAL P2                 /*!<@brief Signal name */
#define BOARD_INITM2_UARTPINS_BT_UART_RTS_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITM2_UARTPINS_BT_UART_RTS_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITM2_UARTPINS_BT_UART_RTS_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                                    /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitM2_UARTPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
